{
  "WELCOME_PAGE_GREETING": "Hej,",
  "WELCOME_PAGE_TEXT": "poznajmy się",
  "VIEW_ABOUT_ME": "O mnie",
  "LEFT_MENU_BUTTON_ABOUT": "O mnie",
  "LEFT_MENU_BUTTON_PROJECTS": "Projekty",
  "LEFT_MENU_BUTTON_CONTACT_ME": "Skontaktuj się",
  "BUTTON_HOME": "Strona główna",
  "BUTTON_ABOUT": "O mnie",
  "BUTTON_PROJECTS": "Projekty",
  "BUTTON_CONTACT_ME": "Skontaktuj się",
  "LABEL_CONTACT_ME": "Skontaktuj się",
  "CITY": "Miasto",
  "PHONE": "Telefon",
  "PROJECTS_TITLE":"Projekty",
  "LABEL_COMPANY": "Nazwa firmy",
  "LABEL_EMAIL": "Email",
  "LABEL_MESSAGE": "Wiadomość",
  "TEMPORARY_DISABLED": "Tymczasowo niedostępne",
  "ENTER_VALID_EMAIL": "Proszę podać poprawny adres e-mail",
  "CONTACT_FORM_TEXT": "Formularz kontaktowy jest tymczasowo niedostępny. Skontaktuj się ze mną w każdej chwili za pomocą e-maila lub telefonu.",
  "COMPANY_FORM_DESCRIPTION": "Proszę wpisać nazwę firmy",
  "ABOUT_ME_TITLE": "O mnie",
  "ABOUT_ME_INTRO": "Cześć! Nazywam się",
  "ABOUT_ME_NAME": "Amadeusz",
  "ABOUT_ME_PROFESSION": " jestem doświadczonym specjalistą IT z doświadczeniem w",
  "ABOUT_ME_DEGREE": "tworzeniu oprogramowania i tytułem inżyniera",
  "ABOUT_ME_EXPERIENCE": "Od 1 grudnia 2023 roku pracuję jako programista, zaczynając jako",
  "ABOUT_ME_ANGULAR_ROLE": "Programista Angular",
  "ABOUT_ME_GROWTH": "a rozwijając się w",
  "ABOUT_ME_FULLSTACK_ROLE": "rolę full-stack",
  "ABOUT_ME_CURRENT_ROLE": "Obecnie specjalizuję się w",
  "ABOUT_ME_JAVA_SPECIALTY": "Java EE",
  "ABOUT_ME_PROJECT_DESC": "i współtworzę",
  "ABOUT_ME_PROJECT_CORE": "główny projekt \"rdzeń\"",
  "ABOUT_ME_CUSTOMER_IMPLEMENTATIONS": "który stanowi podstawę różnych implementacji dla klientów. Moim głównym celem jest rozwiązanie stworzone dla",
  "ABOUT_ME_SWISS_LIFE": "Swiss Life",
  "ABOUT_ME_AXA_JOURNEY": "choć moja podróż rozpoczęła się od współpracy z",
  "ABOUT_ME_AXA_SITE": "AXA",
  "ABOUT_ME_SKILLS_DEV_1": "Te doświadczenia pozwoliły mi rozwijać umiejętności zarówno w",
  "ABOUT_ME_SKILLS_DEV_2": "frontendzie, jak i backendzie, ",
  "ABOUT_ME_SKILLS_DEV_3": "co umożliwia mi stawianie czoła różnorodnym wyzwaniom w zakresie tworzenia aplikacji webowych.",
  "ABOUT_ME_THANK_YOU": "Dziękuję za odwiedzenie mojej strony!",
  "ABOUT_ME_PASSION": "Mam ogromną pasję do programowania, ponieważ pozwala mi ono uwolnić kreatywność i realizować nowe pomysły.",
  "ABOUT_ME_EXPERIENCE_IMPACT": "Na przestrzeni lat moja wiedza obejmuje zarówno",
  "ABOUT_ME_FRONTEND": "frontend",
  "ABOUT_ME_AND": "i",
  "ABOUT_ME_BACKEND": "backend",
  "ABOUT_ME_LARGE_PROJECTS": "co pozwala mi pracować nad",
  "ABOUT_ME_CORE_PROJECTS": "kilkuset milionowymi projektami",
  "ABOUT_ME_CORE_PROJECTS_IMPACT": " które mają realny wpływ na rzeczywistość.",
  "ABOUT_ME_FOCUS_TECH": "Moje główne technologie to HTML, CSS, JavaScript, MongoDB, TypeScript, Tailwind, Angular, mongoDb i Java EE, a także doświadczenie z różnymi frameworkami",
  "ABOUT_ME_NETWORK_EXP": "Poza programowaniem pracowałem także jako specjalista ds. sieci, zdobywając cenne doświadczenia w zakresie infrastruktury systemowej.",
  "ABOUT_ME_CODING_PASSION": "Jednak największą radość daje mi programowanie, w którym eksploruję nieograniczone możliwości, współpracuję z utalentowanymi zespołami i stale rozwijam swoje umiejętności, aby sprostać nowym wyzwaniom.",
  "SEE_MORE_PROJECT": "Aby zobaczyć więcej szczegółów o interesującym Cię projekcie, kliknij na niego!",
  "FOR_LIFE_VERSION": "Aby przejść do wersji live, kliknij link, a zostaniesz przekierowany.",
  "VIEW_FULL_IMAGE": "Aby zobaczyć obraz w pełnym rozmiarze, kliknij go :D",
  "projects": {
    "TMS-team-management-system": {
      "title": "TMS - System Zarządzania Zespołem",
      "description": "Stworzony przez czteroosobowy zespół. Dwóch z nas zajmuje się frontendem, a dwóch backendem. Niestety, mój kolega frontendowiec zachorował na covid podczas tworzenia wersji beta, która jest obecnie dostępna, przez co cały frontend poza testami został wykonany przeze mnie. To wersja MVP, ale działa dla klientów zarządzających zespołami."
    },
    "sneakers-shop": {
      "title": "Sklep z Sneakerami",
      "description": "Prosty sklep zaprojektowany dla małych sprzedawców, którzy skupiają się na limitowanych modelach sneakerów. W wersji beta klienci mogą się logować, dodawać produkty do koszyka i finalizować zakupy z opcją płatności przez PayPal. Projekt ciągle jest rozwijany."
    },
    "stockx-fix-extension": {
      "title": "Rozszerzenie StockX Fix",
      "description": "Rozszerzenie Tampermonkey, które poprawia układ strony StockX, automatycznie ukrywając sekcje witryny. Umożliwia także dodawanie przedmiotów do koszyka użytkownika z zewnętrznych stron."
    },
    "portfolio-site": {
      "title": "Strona Portfolio",
      "description": "To moje osobiste portfolio, prezentujące wszystkie moje dotychczasowe prace i projekty. Zbudowane z Angulara i Tailwind CSS, aby stworzyć responsywną i lekką stronę."
    },
    "comarch-digital-insurance": {
      "title": "Comarch Digital Insurance",
      "description": "Comarch Digital Insurance (CDI) to kompleksowa cyfrowa platforma zaprojektowana dla branży ubezpieczeniowej. Umożliwia firmom ubezpieczeniowym usprawnienie ich operacji poprzez automatyzację procesów, takich jak tworzenie polis, underwriting, zarządzanie roszczeniami i obsługa klienta."
    },
    "many-more": {
      "title": "Wiele innych projektów",
      "description": "Wiele innych małych projektów, od skryptów w JavaScript i Pythonie po aplikacje Angular. Sprawdź mój GitHub, aby zobaczyć pełną listę."
    }
  },
  "projectDetail": {
    "TMS": {
      "architecture": {
        "title": "Architektura",
        "description": "Strona UI to połączenie Vue i Vuetify, które zapewniają wysoką responsywność po stronie użytkownika i czytelność. Strona serwera aplikacji składa się z kilku modułów. Baza danych SQLite odpowiada za przechowywanie danych. Komunikacja z bazą danych odbywa się dzięki frameworkowi Django. Korzystamy z frameworka REST do wymiany danych między interfejsem użytkownika a serwerem aplikacji."
      },
      "dashboard": {
        "title": "Panel trenera",
        "description": "Widok zawierający ostatnie 3 mecze drużyny po lewej stronie. Obecność na ostatnich treningach po prawej. Tabela z szczegółowymi informacjami o wynikach każdego zawodnika w wybranym meczu na dole. Widok ten ma pomóc trenerom w szybkim sprawdzeniu stanu ostatnich kilku dni."
      },
      "matches": {
        "title": "Widok meczów",
        "description": "Główny widok zawierający wszystkie mecze. Użytkownik może dodać mecz w 3 krokach, dodając wydarzenie->mecze drużyn->wyniki graczy. Obsługa błędów obejmuje każdą nieprawidłową dane wejściowe. W przypadku błędu użytkownik może dodać brakujące elementy w szczegółowym widoku meczu. Zwycięska drużyna jest zaznaczona na zielono. Dodawanie i usuwanie treningów jest podobne do robienia tego na widoku graczy i trenerów, aby ułatwić użytkownikowi obsługę."
      },
      "singleMatch": {
        "title": "Widok pojedynczego meczu",
        "description": "Szczegółowy widok meczu. Dwa sortowalne tabele z wynikami graczy, które użytkownik może edytować. Pole wyszukiwania działa na każdym parametrze. W przypadku błędów danych wejściowych, to tutaj użytkownik może dodać brakujące dane. Każde wejście ma swoje zasady."
      },
      "calendar": {
        "title": "Widok kalendarza",
        "description": "Widok kalendarza, ułatwiający wyszukiwanie nadchodzących wydarzeń. Zawiera treningi, mecze. Użytkownik może dodać po prostu wydarzenie, np. 'spotkanie drużyny'. Użytkownik może zmieniać widok na dzień-4 dni-tydzień-miesiąc, z domyślnym widokiem miesiąca."
      },
      "knowledgebase": {
        "title": "Baza wiedzy",
        "description": "Miejsce, w którym użytkownicy mogą uzyskać dostęp do profesjonalnej wiedzy."
      },
      "singleKnowledgebase": {
        "title": "Pojedynczy artykuł bazy wiedzy",
        "description": "Widok pojedynczego artykułu, z dodatkowymi szczegółami."
      },
      "players": {
        "title": "Lista graczy",
        "description": "Widok z tabelą, w której znajdują się wszyscy gracze. Wyszukiwanie działa po: imieniu, nazwisku, płci i e-mailu. Tabela jest sortowalna według każdego z parametrów. Zgodnie z zasadą F, przycisk edycji oraz przycisk dodawania są dostępne w prawym górnym rogu."
      },
      "playersAdd": {
        "title": "Dodawanie i edytowanie graczy",
        "description": "Dodawanie graczy ma różne zasady w zależności od drużyny gracza. Jeśli to nasz gracz, użytkownik musi wprowadzić wszystkie dane. Jeśli nie, należy dodać tylko imię i nazwisko oraz płeć. Przycisk edycji dodaje wiersz edycji do tabeli, umożliwiając użytkownikowi usuwanie/edycję graczy."
      },
      "trainings": {
        "title": "Widok treningów",
        "description": "Widok zawierający wszystkie treningi. Użytkownik może dodawać i usuwać treningi, klikając w prawym górnym rogu. Sortowanie na podstawie zapytań zostało dodane w wersji beta 0.2, a wersja na żywo nie będzie odzwierciedlać ekranu. Klikając na indywidualny trening, użytkownik przechodzi do widoku pojedynczego treningu."
      },
      "trainingsAdd": {
        "title": "Dodawanie i edytowanie treningów",
        "description": "Dodawanie i usuwanie treningów jest podobne do robienia tego na widokach graczy i trenerów, aby uprościć proces dla użytkownika."
      },
      "singleTraining": {
        "title": "Widok pojedynczego treningu",
        "description": "Tutaj użytkownicy mogą wysyłać powiadomienia do graczy biorących udział w wybranym treningu oraz oglądać więcej szczegółów dotyczących treningu."
      }
    },
    "sneakerShop": {
      "mainPage": {
        "title": "Strona główna",
        "description": "Starałem się, aby była jak najprostsza. Zgodnie z zasadą F/Z, koszyk i strona logowania znajdują się w prawym górnym rogu. Logo w lewym górnym rogu jest również linkiem do strony głównej. Modele produktów są sortowane według głównych kategorii i modeli."
      },
      "productPage": {
        "title": "Strona produktu",
        "description": "Strona produktu jest jak najprostsza, aby zapewnić najlepszą czytelność."
      },
      "login": {
        "title": "Logowanie",
        "description": "Użytkownicy mogą się logować i rejestrować za pomocą e-maila i hasła."
      },
      "loginFirebase": {
        "title": "Logowanie przez Firebase",
        "description": "Firebase jest odpowiedzialny za zarządzanie i przechowywanie danych użytkowników. Strona ma funkcję automatycznego logowania, aby nie stracić stanu po odświeżeniu oraz automatycznego wylogowywania po wygaśnięciu tokena."
      },
      "cartNoItem": {
        "title": "Koszyk (Brak przedmiotów)",
        "description": "Pusta strona koszyka jest przyjazna dla użytkownika, zawiera tylko 2-elementowy koszyk z animowanymi bąbelkami (czysty CSS) i przycisk zachęcający użytkownika do powrotu do strony głównej i dodania czegoś."
      },
      "cartItem": {
        "title": "Koszyk (Przedmiot dodany)",
        "description": "Strona koszyka zawiera sumę przedmiotów, animacje przy usuwaniu, i wiele innych."
      },
      "features": {
        "title": "Funkcje",
        "description": "Modele produktów są sortowane według głównych kategorii i modeli, dzięki czemu można je łatwo sortować. Zaimplementowano również wyświetlanie informacji o dostępności rozmiarów."
      },
      "mainPageSm": {
        "title": "Strona główna (Mobile)",
        "description": "Strona główna dla wersji mobilnej ma pasek nawigacji przeniesiony z góry na dół, aby był łatwiejszy i bardziej przyjazny dla urządzeń mobilnych."
      },
      "mainPageSmSidebar": {
        "title": "Pasek boczny strony głównej (Mobile)",
        "description": "Przyciski paska bocznego przeniesiono do menu po lewej stronie, aktywowanego przez ikonę hamburgera."
      },
      "more": {
        "title": "Więcej wkrótce...",
        "description": "Wciąż pracuję nad tym projektem. Przedmioty są teraz przechowywane tylko w pamięci lokalnej, brak danych użytkowników. Celem jest przechowywanie przedmiotów na Firebase, połączenie użytkowników z bazą danych i dodanie płatności. UI nie jest jeszcze ukończone, wymaga dopracowania."
      }
    },
    "stockx": {
      "allItemsWithout": {
        "title": "Wszystkie przedmioty bez filtrów",
        "description": "Lista wszystkich przedmiotów bez zastosowania filtrów."
      },
      "allItems": {
        "title": "Sprawdź wszystkie przedmioty",
        "description": "Funkcja aktywowana przez kliknięcie lewego przycisku na górnym pasku nawigacji. Wyróżnia przedmioty, gdzie cena użytkownika nie jest najniższą."
      },
      "itemWithout": {
        "title": "Widok przedmiotu bez rozszerzenia",
        "description": "Obrazek pokazujący, jak wygląda StockX bez rozszerzeń."
      },
      "itemWith": {
        "title": "Widok przedmiotu z rozszerzeniem",
        "description": "Obrazek pokazujący, jak wygląda StockX po rozszerzeniu, z dodatkowymi funkcjami."
      }
    },
    "portfolio": {
      "good": {
        "title": "Cóż...",
        "description": "Jesteś już na tej stronie :D. Zachęcam do kontaktu i podzielenia się opinią."
      },
      "more": {
        "title": "Więcej wkrótce",
        "description": "Wciąż pracuję nad tą stroną. Chcę uczynić ją dwujęzyczną za pomocą pipe, dodać więcej animacji, aby była bardziej przyjazna użytkownikowi, poprawić wersje mobilne obrazów, zwiększyć jej widoczność w Google i wiele więcej..."
      }
    },
    "comarch": {
      "cdi1": {
        "title": "Wsparcie dla ubezpieczeń zdrowotnych",
        "description": "Ułatwia zarządzanie polisami ubezpieczeniowymi, oferując narzędzia dla agentów, brokerów i pracowników biura obsługi."
      },
      "cdi2": {
        "title": "Zautomatyzowane przetwarzanie roszczeń",
        "description": "Integracja z Comarch Insurance Claims pozwala na sprawne zarządzanie roszczeniami."
      },
      "cdi3": {
        "title": "Zgodność z przepisami",
        "description": "CDI przestrzega norm branżowych, takich jak RODO, IDD (Dyrektywa o dystrybucji ubezpieczeń) i PRIIPS (Produkty inwestycyjne detaliczne oparte na ubezpieczeniu)."
      },
      "cdi4": {
        "title": "Wdrożenie w chmurze",
        "description": "Platforma może być wdrożona w chmurze, oferując skalowalność i dostępność."
      },
      "cdi5": {
        "title": "Integracja z AI",
        "description": "Chociaż AI nie jest bezpośrednio zintegrowane z CDI, Comarch oferuje oddzielny framework AI, który może być używany do podejmowania decyzji opartych na danych i automatyzacji procesów."
      }
    },
    "manyMore": {
      "github": {
        "title": "Odwiedź moje GitHub :D",
        "description": "Kliknij w link, aby przejść do mojego GitHub."
      }
    }

  }
}
